package library;

class Archive {

    Book book;                                  // переменная book, типа Book. Это свойство архива,Archive работает с book.
    int maxQuantity = 50;                       // задаем максимальное кол-во книг в архиве.
    int quantity;                               // актуальное кол-во книг в архиве

    public void putBook(Book book, int quantity) {   //метод положить книгу/и, работает с книгами и их кол-вом
        if ( maxQuantity >= 50){                     // проверяем, что архив не переполнен
            System.out.println("Архив заполнен.");
        } else {                                     // если место есть, то нужно внести книгу в архив
            this.book = book;                        // использаем this, но не совсем понимаю почему это работает...
            // наверно нужен какойто подсчет,сколько книг добавилось к хранению
            System.out.println("В архив добавлена " +  + " экземпляр " + );  // нужно добавить ссылки:
                                                                            // сколько и какие книги добавлены
        }
    }

    public int getBook(Book book, int quantity) {    // метод взять книгу/и
        // тут нужена проверка, возможно ли выдать запрошенное кол-во книг
        // причем, наверно, надо проверить, есть ли именно запрашиваемые книги
        // в нужном количестве, если true, то нужно после выдачи книг уменьшить
        // переменную архива (quantity) и счетчик конкретных книг.( Получается нужны переменные
        // хранящие количество книг конкретного типа, это roman1 и roman2? И какое изначально их количество?
        // или архив пустой изначально пустой и мы должны сначала putBook?
        return maxQuantity;                          // возвращает кол-во книг оставшихся в архиве
    }




}
